In [1]:
import pandas as pd
employees = pd.DataFrame({
    "EmpID": [1, 2, 3],
    "Name": ["Alice", "Bob", "Charlie"],
    "DeptID": [10, 20, 30]
})

departments = pd.DataFrame({
    "DeptID": [10, 20, 40],
    "DeptName": ["HR", "Engineering", "Marketing"]
})

In [2]:
employees

   EmpID     Name  DeptID
0      1    Alice      10
1      2      Bob      20
2      3  Charlie      30

In [3]:
departments

   DeptID     DeptName
0      10           HR
1      20  Engineering
2      40    Marketing

In [5]:
pd.merge(employees,departments,on ="DeptID") ##Inner Join (common DeptID)

   EmpID   Name  DeptID     DeptName
0      1  Alice      10           HR
1      2    Bob      20  Engineering

In [6]:
pd.merge(employees,departments,on ="DeptID",how = "left") ##left join(here employees waale)

   EmpID     Name  DeptID     DeptName
0      1    Alice      10           HR
1      2      Bob      20  Engineering
2      3  Charlie      30          NaN

In [7]:
pd.merge(employees,departments,on ="DeptID",how = "right") ##right join(here departments waale)

   EmpID   Name  DeptID     DeptName
0    1.0  Alice      10           HR
1    2.0    Bob      20  Engineering
2    NaN    NaN      40    Marketing

In [8]:
pd.merge(employees,departments,on ="DeptID",how = "outer") ##outer join(both)

   EmpID     Name  DeptID     DeptName
0    1.0    Alice      10           HR
1    2.0      Bob      20  Engineering
2    3.0  Charlie      30          NaN
3    NaN      NaN      40    Marketing

In [19]:
df1 = pd.DataFrame({"Name":["alice","momin"],"Score":[2324,142]})
df2 = pd.DataFrame({"Name":["junaid","gowhar"],"Age" : [34,57]})

In [20]:
df1

    Name  Score
0  alice   2324
1  momin    142

In [21]:
df2

     Name  Age
0  junaid   34
1  gowhar   57

In [22]:
pd.concat([df1,df2])

     Name   Score   Age
0   alice  2324.0   NaN
1   momin   142.0   NaN
0  junaid     NaN  34.0
1  gowhar     NaN  57.0

In [23]:
pd.concat([df1,df2],axis=1)##column wise concatenation

    Name  Score    Name  Age
0  alice   2324  junaid   34
1  momin    142  gowhar   57